[{"created": 1408633656000, "duration": 7200000, "id": "202307712", "name": "Louisville BI & Big Data Analytics KickOff!", "rsvp_limit": 30, "status": "past", "time": 1411682400000, "updated": 1412015827000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 15, "venue": {"id": 9095122, "name": "Bellarmine University", "lat": 38.220733642578125, "lon": -85.70416259765625, "repinned": false, "address_1": "2001 Newburg Road", "city": "Louisville", "country": "us", "localized_country_name": "USA", "zip": "40205", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/202307712/", "description": "<p>                                      Join us for our BI &amp; Analytics Kickoff Party!  </p> <p>Zain Khandwala, the founding executive director of the Institute for Advanced Analytics at Bellarmine University will share with us Bellarmine's vision for Data Science.</p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/8/7/9/8/600_405334712.jpeg\" /></p> <p>“There have been a number of fields and sub-disciplines around the better use of data to help businesses do those things,” he said. “Operations research, marketing research, managerial science, actuarial science – these are all inherently quantitative disciplines that served business well for a number of decades.”</p> <p><br/>But what ended up happening was the “datafication” of the world, said Mr. Khandwala. “More automated processes, enhanced technologies, our increasing capacity to store data and the development of the web” led to a data revolution. “As a result, organizations are looking at their data assets, their data warehouses, and trying to better understand how to leverage it – to answer some of the questions we felt were unanswerable in the past,” he said.</p> <p>&lt;a href=\"http://www.bellarminemagazine.com/wp-content/uploads/2014/07/Zain.jpg\"&gt;&lt;/a&gt;This new way of thinking about data isn’t just about volume, storage or retrieval; it’s also about timeliness and what Mr. Khandwala calls holistic thinking. “In the past, you might meet to make decisions based on a report from a month ago. Now data is at your fingertips, it’s being produced and collated in real time and accessible – if only we have the wherewithal and talent to leverage it,” he said.</p> <p>To help prepare a new generation of data decision-makers, the Institute is launching a Master of Science in Analytics (MSA) degree this fall. Future plans include cross-disciplinary analytics coursework, certification programs, corporate training, and research and consulting services. Mr. Khandwala will hire faculty and staff, but the Institute will also benefit from the wealth of faculty talent in other disciplines at Bellarmine.</p> <p>The MSA program is an intensive 10-month, full-time, STEM master’s degree, focusing on business and organizations (as opposed to scientific and engineering data analysis). The program is modeled on a pioneering degree at North Carolina State University, where Mr. Khandwala earned his MSA. (He also holds an MBA in management science and marketing from the University of Toronto and a BS in computer science from the University of British Columbia.)</p> <p>A native of Calgary, Alberta, Canada, he attended high school in Kuala Lumpur, Malaysia. Before coming to Bellarmine, he was a researcher and lecturer for various education programs and, most recently, an analytics recruiter for J.P. Morgan Chase.</p> <p>He hopes to enroll 20 students for the first-year program at Bellarmine and escalate to 40 students within three years. Students will come from Louisville, of course, but he will also recruit regionally and nationally and establish industry partnerships.</p> <p>Indications are that there is a huge demand. Conjecturally, almost any organization can make better use of digital data. “Banks, insurance companies and telcos [telecommunications companies] were quickest to datafy their world,” said Mr. Khandwala. Louisville’s major corporations have substantial and exponentially growing data challenges and opportunities.</p> <p>But small organizations, governments and nonprofits can also make use of better analytics. “The Gartner Report says that by 2018 there will be a shortage of 200,000 to 400,000 analytics professionals or data-savvy professionals across the country,” he said. So it’s not just big business that stands to gain. “A lot of charitable organizations with limited resources use analytics to figure out who they’re likely to get the fastest and best response from,” he said.</p> <p>And analytics, much like the PC, Internet and smartphone revolutions that preceded and helped spawn it, even comes with its own rock stars. “President Obama’s re-election campaign was a celebrated use of analytics – the data scientists who worked on that campaign were very savvy people. They are celebrities in our community now,” said Mr. Khandwala.</p> <p>So, who are these future data rock stars? “A lot of our candidates will come straight out of undergrad,” said Mr. Khandwala. “People with quantitative aptitude, quantitative training and business understanding. There will also be a lot of career changers – people who recognize that this is the hot new space. There are organizations clamoring for the position and paying very well for it. And a lot are people who are already doing data work – business intelligence, producing reports, telling stories with data – but who want to elevate their skill sets.”</p> <p>One way Bellarmine will do that is by teaching what Mr. Khandwala calls the “art and culture” of analytics. “You could approach data science or analytics in a purely scientific way,” he said. “You could say, ‘Here’s how you run certain models; here’s how you extract data; here’s how you write the SQL code; here’s how you get outputs.’ That’s the science behind analytics.</p> <p>“To me, the art behind analytics is equally important. It is working with the business partners and the other stakeholders in an organization. It’s helping them understand what the organizational needs are, what the challenges are, what business problems they face and working with them to figure out what the priorities should be. How can we better manage our data assets? Which of these problems are most solvable using the data?</p> <p>“That’s the art of analytics. The culture of analytics is an organizational thing. How do we become more data inquisitive? How do we get to a place where all of our conversations can be data-driven? How do we go from thinking deterministically to probabilistically? How do you create a culture where an organization is continually learning about itself from data?”</p> <p>One way students will think deeply about the art and culture of analytics is through intensive, eight-week internships at local organizations. This is a part of the program that benefits the students, benefits the businesses or organizations, and is a foundational concept behind creating an institute and not simply a new master’s degree. “I have no doubt that we can create experiences that are valuable for the student – working with real data in a real-world situation – but also create substantive value for the organizations,” said Mr. Khandwala.</p> <p>“One advantage we have as an institute is to help advance the use of analytics within our organization itself. After the internship, we can bring the students back in to work for a couple of months on a capstone project that is in service to the university.”</p> <p>Another discipline in keeping with Bellarmine’s values is the incorporation of ethics into the program. There are infamous examples of ethical lapses in the era of digital data, from derivatives shenanigans to high-frequency trading, to government spying, to creepy examples like a famous 2012 incident involving Target. The retailer got in hot water by using its data to correctly identify a high school girl as being pregnant – and sending her coupons for maternity clothes and baby products – before she had even told her family.</p> <p>“There are hard questions, not just about security and privacy – those are germane and beginning to be well understood – but there are questions that go beyond that: What does it mean to target ethically? How do you incorporate social justice? How do you differentiate without prejudicing? Ethics will be a component of what we’re calling ‘analytical leadership,’ ” he said.</p> <p>“There are three foundational courses of the program: Analytical Leadership, the Analytical Organization and Foundations to Analytical Thought. This is where we involve the liberal arts – how do you think analytically, how do you think creatively, what is the right application of logic and the quantitative sciences – to arrive at what we might loosely call truths.”</p> <p>If that all sounds like a complex turn around the dance floor, consider Mr. Khandwala’s hobby: He’s a Latin dancer. Once a competitive dancer and a teacher of salsa and merengue dancing, he now dances socially. “I’ve found that Louisville has a great community for it. Thursday nights at Sky Bar above Saints in St. Matthews – it’s the big night for dancing here!” he said. “I’m also going to be the faculty sponsor for a Latin-dance club here on campus. That’s a big passion of mine.”</p> ", "how_to_find_us": "Library Room B24", "visibility": "public", "comment_count": 3}, {"created": 1412183627000, "duration": 9000000, "id": "210752232", "name": "How do you Visualize your Data? Data visualization made easy with Actuate BIRT", "rsvp_limit": 50, "status": "past", "time": 1413496800000, "rsvp_close_offset": "PT24H", "updated": 1413563648000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 15, "venue": {"id": 18296902, "name": "iHub", "lat": 38.25377655029297, "lon": -85.74844360351562, "repinned": false, "address_1": "204 South Floyd Street", "city": "Louisville", "country": "us", "localized_country_name": "USA", "zip": "", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/210752232/", "description": "<p>Large-scale, customer-facing applications are the very heart of what we do at Actuate.</p> <p>• Deliver personalized analytics and insights to millions of users easily and securely. </p> <p>• Gain and retain customers by delivering a differentiated online experience. </p> <p>• Access multiple data sources simultaneously, and provide the information in real-time through interactive data visualizations</p> <p><br/>The two most challenging aspects of delivering a personalized, data-driven customer experience are:</p> <p>1. Scaling a large, complex, data-rich application to more than a few users, in a secure way. <br/>2. Fulfilling on the promise of personalization by providing the right level of analytics on the required data set to each consumer – <br/>especially in the context of a large scale application such as a customer-facing deployment.</p> <p>These are the most difficult kinds of applications to deliver. Some companies provide tailored dashboards to small user populations. Others provide static reports to the masses. Only Actuate delivers highly personalized data visualization and analytics securely to millions of users.</p> <p>Companies in every industry rely on Actuate to build web and mobile self-service analytics applications that give their clients direct, interactive access to their own account information. Providing high quality customer interaction improves satisfaction, retention and ultimately profitability. </p> ", "visibility": "public", "comment_count": 0}, {"created": 1413564516000, "duration": 7200000, "id": "214036622", "name": "Big Data: Headache or Head Start?", "rsvp_limit": 50, "status": "past", "time": 1416526200000, "updated": 1417040963000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 19, "venue": {"id": 18296902, "name": "iHub", "lat": 38.25377655029297, "lon": -85.74844360351562, "repinned": false, "address_1": "204 South Floyd Street", "city": "Louisville", "country": "us", "localized_country_name": "USA", "zip": "", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/214036622/", "description": "<p>Crucial decisions depend on solid business intelligence.  Build a vivid picture leveraging all your data, even the data you didn’t think you could visualize!  </p> <p>For more than 25 years, data management has been relegated to IT back rooms and limited to strict structure. But in a world where data is king (and also changing and growing at a lightning pace), you have to rethink the technologies you use to empower your organization to monetize and extract value from all that data. </p> <p>In this session, you’ll learn how this new shift in IT — <i><b>data emerging as the next killer app</b></i> — requires a new generation of database. </p> <p>• You’ll learn about new features and capabilities that will unlock the potential in your data, and enable you to do things you never thought possible. </p> <p>• You’ll hear how enterprises are benefiting from today’s modern technology, and how they’ve moved beyond data headaches to getting a head start in this new data and information economy</p> <p>JOIN us for dinner &amp; an exploration of BIG DATA : Headache or Head Start with MarkLogic!!</p> ", "visibility": "public", "comment_count": 2}, {"created": 1417040295000, "duration": 7200000, "id": "218916789", "name": "An Introduction to Hadoop for Big Data Analysis", "rsvp_limit": 50, "status": "past", "time": 1418945400000, "updated": 1420744935000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 22, "venue": {"id": 18296902, "name": "iHub", "lat": 38.25377655029297, "lon": -85.74844360351562, "repinned": false, "address_1": "204 South Floyd Street", "city": "Louisville", "country": "us", "localized_country_name": "USA", "zip": "", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/218916789/", "description": "<p>Over the last few years, Hadoop has emerged as the de facto standard for storing and processing huge amounts of data, both structured and unstructured. Join Ian Wrigley, Director of Educational Curriculum at Cloudera, for an introduction to Hadoop and the ecosystem of open source projects that surround it. We'll discuss just how Hadoop stores data reliably, and what tools are available to process that data. Find out how you can get actionable insights from big data using skills you already have.</p> <p>Ian Wrigley was the second hire in Cloudera's Educational Services department, and has taught thousands of people how to install, manage, and develop on Hadoop clusters. He authored the extremely popular Udacity Hadoop online course, which has had over 50,000 participants, as well as several instructor-led courses on Hadoop and its ecosystem of tools. As Director of Educational Curriculum, he currently manages the team responsible for creating all of Cloudera's training materials.</p> ", "visibility": "public", "comment_count": 3}, {"created": 1423084898000, "duration": 7200000, "id": "220307826", "name": "TEK Talk", "rsvp_limit": 40, "status": "past", "time": 1424386800000, "updated": 1424450436000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 14, "venue": {"id": 23619238, "name": "TEK Systems ", "lat": 38.254859924316406, "lon": -85.76640319824219, "repinned": false, "address_1": "700 N. Hurstbourne Pkwy The 700 Room", "city": "Louisville", "country": "us", "localized_country_name": "USA", "zip": "", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/220307826/", "description": "<p>People are at the heart of every successful business initiative. At TEKsystems, a leading provider of IT staffing, IT talent management and IT services, we understand people. Every year we deploy over 80,000 IT professionals at 6,000 client sites across North America, Europe and Asia. Our deep insights into the IT labor market enable us to help clients achieve their business goals—while optimizing their IT workforce strategies.</p> <p>\n\nJoin Thomas Kent, Technical Recruiter, ERP Support Services at TEKsystems &amp; </p> <p>\n\nErica Sturgill, Technical Recruiter at TEKsystems  </p> <p>\n\nfor pizza, swag &amp; WHO KNOWS! You may get recruited!! :) </p> ", "how_to_find_us": "Main level conference room - down main hallway to the left", "visibility": "public", "comment_count": 1}, {"created": 1421776349000, "duration": 7200000, "id": "219960984", "name": "What is a Data Lake? Introduction to the Advantages of an EMC Data Lake", "status": "past", "time": 1426804200000, "updated": 1426831791000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 12, "venue": {"id": 23619238, "name": "TEK Systems ", "lat": 38.254859924316406, "lon": -85.76640319824219, "repinned": false, "address_1": "700 N. Hurstbourne Pkwy The 700 Room", "city": "Louisville", "country": "us", "localized_country_name": "USA", "zip": "", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/219960984/", "description": "<p>Bring data, applications, and analytics together to lower costs and unlock the value of your digital assets.</p> <p>In the face of interconnected mobile devices, rich media, web content, and growth in traditional file workflows, organizations the world over are faced with an IT dilemma: how to manage the amount of unstructured data that is doubling in size every two years.</p> <p>And for those growth-minded organizations looking to improve their business results, the dilemma takes on an added dimension—analytics. How can they achieve a flexible infrastructure that allows them to unlock the business value of their data and gain new insight?</p> <p>The answer to the big data problem</p> <p>The answer to this problem is a holistic approach that brings data, applications, and analytics together—in other words, a data lake.  With this solution, data is ingested, catalogued, inventoried, and controlled, regardless of the source or destination.</p> <p>But, to achieve a Data Lake, organizations first need to consolidate and eliminate their inefficient storage silos. This requires a foundation—a Data Lake Foundation—which provides the underlying data storage infrastructure that powers a Data Lake.</p> <p>With a Data Lake Foundation, you can provide your customers a solution that will:</p> <p>Eliminate storage silos to reduce costs and simplify storage managementProvide a flexible scale-out architecture for massive scalabilitySupport a wide range of traditional and next generation (3rd Platform) workloadsEnable cost-efficient, in-place big data analytics via support for protocols such as HDFSOffer efficient and resilient backup, disaster recovery, and security options</p> <p>Introduction to the Advantages of an EMC Data Lake Foundation sponsored by EMC : </p> <p>Tom Snyder</p> <p>Regional Territory Manager</p> <p>EMC – Isilon Scale-Out Division</p> <p>Experienced professional dedicated to the application of information technology to solve business needs.  Primary focus:  understanding customer's business first; and utilizing my experience to develop technology solutions which will improve revenue, increase productivity, enhance efficiency, and provide return on investment.  Past 12 months have focused on the evolution of the “Data Lake” concept and the use of analytics to leverage information to expand and/or create business opportunities.</p> <p>Specialties:  Scale-out solutions for Analytics, Information Management, storage, backup and recovery, archive, advanced networking (MPLS,IP), cloud computing and application support, storage and virtual applications.</p> ", "how_to_find_us": "Next to the Churchill Downs building on Hurstbourne Ln. near U of L's Shelby Campus - Front Entrance - Left hallway", "visibility": "public", "comment_count": 2}, {"created": 1428614381000, "id": "221736714", "name": "Spring Social", "status": "past", "time": 1429218000000, "updated": 1429231393000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 6, "venue": {"id": 23754959, "name": "Baxter's 942", "lat": 38.24074172973633, "lon": -85.72480010986328, "repinned": false, "address_1": "942 Baxter Ave", "city": "Louisville", "country": "US", "localized_country_name": "USA"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/221736714/", "description": "<p>Come on out for a Spring Social!  </p> <p>No sponsor - No speaker - just a rowdy bunch of Data Junkies getting together for Happy Hour!</p> <p><br/>MON-FRI HAPPY HOUR</p> <p><br/>2 for 1 Beers &amp; Cocktails from 4pm - 7pm</p> <p>Thursday</p> <p><br/>$1.50 Domestic BTLS<br/>$2.50 Shots of Fireball<br/>$2 LITS</p> <p><a href=\"http://baxters942.com/our-menu/\"><a href=\"http://baxters942.com/our-menu/\" class=\"linkified\">http://baxters942.com/our-menu/</a></a></p> ", "visibility": "public", "comment_count": 1}, {"created": 1442949860000, "duration": 10800000, "id": "225540983", "name": "Smarter Analytics in the Cloud", "status": "past", "time": 1443114000000, "updated": 1443128035000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 1, "venue": {"id": 4241882, "name": "Churchill Downs", "lat": 38.20541000366211, "lon": -85.76720428466797, "repinned": false, "address_1": "1 Central Avenue", "city": "Louisville", "country": "us", "localized_country_name": "USA", "zip": "", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/225540983/", "description": "<p>To RSVP: Please email me at flandin@us.ibm.com with your name, title and direct phone # or call Fatima at 1-703-483-5804</p> <p><br/>Intros and Kickoff - 'So What?' and 'Why IBM'<br/>        Gary Pranger - Tech Specialist<br/>Cloudant - Build more and grow more with Cloudant DBaaS<br/>         Zoltan Mesko - SaaS Solution Leader<br/>         DEMO: Leslie Rodriguez - Cloud SaaS Tech Specialist<br/>DashDB Analytics in the Cloud - Harness your data for building more wiht IBM dashDB<br/>        Andrew Buckler - WW Tech Specialist for Cloud Data Services<br/>         DEMO: Leslie Rodriguez - Cloud SaaS Tech Specialist<br/>TWC and Twitter Partnerships - Leveraging weather and social media data for actional insights<br/>         Zoltan Mesko - SaaS Solution Leader</p> <p><br/>BREAK</p> <p>Watson Analytics - IBM's single interface for data discovery and analytics for business and data scientists<br/>          Lindsey Smith - Tech Specialist/Watson Analytics Evangelist<br/>Spark - The hottest open source project that exists right now<br/>          Gary Pranger - Tech Specialist<br/>Q&amp;A</p> <p>To RSVP: Please email me at flandin@us.ibm.com with your name, title and direct phone # or call Fatima at 1-703-483-5804</p> ", "visibility": "public", "comment_count": 0}, {"created": 1442418483000, "duration": 27000000, "id": "225396497", "name": "Big Data & Analytics for the Internet of Things (IoT)", "status": "past", "time": 1445344200000, "updated": 1445374455000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 5, "venue": {"id": 24083298, "name": "Kentucky Speedway", "lat": 38.70556640625, "lon": -84.92398071289062, "repinned": false, "address_1": "1 Speedway Drive", "city": "Sparta", "country": "us", "localized_country_name": "USA", "zip": "41086", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/225396497/", "description": "<p>REGISTER FOR THIS EVENT NOW - SEE LINK BELOW.  REGISTRATION WILL CLOSE ON SUNDAY, 10/18.</p> <p><b>In order to confirm your seat at this event (space is limited), you must register at this URL: <a href=\"http://ibm.co/1Lmx35Z\">ibm.co/1Lmx35Z</a></b><br/>Join us for a very exciting Internet of Things (IoT) Developer Day at the Kentucky Speedway on Tuesday, October 20th at 8:30 am in Sparta, Kentucky.</p> <p>This Developer Day will be co-sponsored by CloudOne, a premier IBM Business Partner,  and the IBM Big Data &amp; Analytics team.  <b><i>Please note that this is a customer event only.</i></b></p> <p>CloudOne helps the world’s best companies make their things for the Internet of Things. The company brings enterprise applications to the cloud, enabling global collaborative development, production and analysis of software and products in real time on individual, secure, private hybrid cloud environments. Trusted by leading brands, CloudOne’s scalable technology is supported by a team of experts and partners who share a passion for making it easier, faster and more economical to make things for the Internet of Things. For more information, visit <a href=\"http://www.oncloudone.com\"><a href=\"http://www.oncloudone.com\" class=\"linkified\">http://www.oncloudone.com</a></a>.</p> <p><b>In order to confirm your seat at this event (space is limited), you must register at this URL: <a href=\"http://ibm.co/1Lmx35Z\">ibm.co/1Lmx35Z</a></b></p> <p><i><b>SPECIAL NOTE:  The first 30 customers to enroll through the registration link and be confirmed in this event will receive a free Pace Car ride during the afternoon of the event.  </b></i><i><b>(click <a href=\"http://www.kentuckyspeedway.com/handler.cfm/template,video/cat_id,48166?med_id=1542431\">Pace Car</a> to get an idea of what it will be like)</b></i></p> <p> The Internet of Things (IoT) is hot, but many are tired of the chatter and ready for action.  Today’s applications are expected to manage a variety of structured and unstructured data, accessed by massive networks of users, devices, and business locations, or even sensors, vehicles and Internet-enabled goods.</p> <p>In today’s continuously changing, always connected business environment, you must make the best possible decisions and put them into action immediately. Real-time actionable insight provides the robust big data and analytics capabilities that allow you to capture, analyze and act on all relevant data, including the stream of data generated by the myriad devices that make up the Internet of Things. Marketers, sales managers, financial analysts and other business users gain the insights they need to act in real time based on timely, trusted data.</p> <p>As you expand big data and analytics capabilities throughout your organization, you need to empower all of your business users to access and analyze data for faster insight. Taking delivery of software, solutions, infrastructure, platforms and services on the cloud can accelerate the value of big data and analytics capabilities, offering scalability with limited upfront investment.</p> <p>Join us to learn about how IBM and CloudOne are helping clients rapidly deliver solutions to Capture, Analyze and Act on IoT data in Real-Time.  The Developer Day kicks off at 8:30am with food and beverages/registration. Bring your laptop because after the morning session, our subject matter experts will help you get hands-on with the technology. </p> <p><b>Agenda (subject to change)</b></p> <p>08:30-09:00 - Registration, Networking &amp; Breakfast<br/>09:00-10:00 - Keynote - IoT Solutions Overview<br/>10:00-12:00 - Capture, Analyze &amp; Act on IoT Data in Real-time<br/>    - Internet of Things (IoT) Foundation Overview<br/>    - Predictive Maintenance &amp; Quality Overview<br/>    - Data Platform for the Internet of Things (IoT)<br/>12:00-01:00 - Lunch &amp; Bluemix Overview/Demo<br/>01:00-04:00 - Hands-on Labs</p> <p>The event will be held at the Kentucky Speedway.  The first 30 people who enroll through the registration link and are confirmed, will receive a free PACE CAR ride on the track.  This event is FREE. Breakfast, Lunch and snacks will be provided. </p> <p><b>Seating is limited.  In order to confirm your seat, you must register at this URL: <a href=\"http://ibm.co/1Lmx35Z\">ibm.co/1Lmx35Z</a> </b></p> <p><b> Thank you and we look forward to seeing you at the event</b></p> ", "how_to_find_us": "Bluegrass Room", "visibility": "public", "comment_count": 0}, {"created": 1444071249000, "duration": 15300000, "id": "225851162", "name": "Forward Looking Businees Intelligence (FLBI) Workshop with a Spark", "rsvp_limit": 10, "status": "past", "time": 1445528700000, "updated": 1445546278000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 3, "venue": {"id": 24133794, "name": "Keystone at the Crossing", "lat": 39.918968200683594, "lon": -86.11116027832031, "repinned": false, "address_1": "9100 Keystone Crossing", "city": "Indianapolis", "country": "us", "localized_country_name": "USA", "zip": "", "state": "IN"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/225851162/", "description": "<p><img src=\"http://photos1.meetupstatic.com/photos/event/7/d/e/600_442742014.jpeg\" /></p> <p>PLEASE REGISTER ONLINE HERE: <a href=\"https://ibm.biz/BdHDt8\"><a href=\"https://ibm.biz/BdHDt8\" class=\"linkified\">https://ibm.biz/BdHDt8</a></a><br/><i>Seating is limited.</i></p> <p>This event is in Indianapolis, if you are up for a short road trip.</p> <p><br/>Join us at this small, hands-on workshop free of charge to discover the unique business value of forward looking business intelligence.</p> <p><br/>If you’re familiar with the value of business intelligence (BI) or you’re just learning how you can dramatically improve your business decisions with BI, you’ll want to attend this hands-on workshop about Forward Looking Business Intelligence (FLBI) led by Cedric Fillmore and Jason Spackman.</p> <p><br/>Through instructor-led hands-on exercises and interactive demos, you’ll discover:</p> <p>• Why you should consider FLBI – the wide range of business challenges you can master with the right analytics</p> <p>• How IBM’s FLBI solutions will improve decision making across your organization</p> <p>• How to progress from knowing what happened before and what is happening now (descriptive and diagnostic analytics), to what is likely to happen next (predictive analytics)</p> <p><br/>And, you’ll see how to integrate this Advanced Analytics content into a meaningful dashboard that “tells a better dashboard story” and encourages rapid analysis by users through an interactive, self-service experience. We will also discuss Spark and how IBM leverages the technology to deliver higher performance analytics. </p> <p><b>Bring your laptops </b>- <b>Lunch will be provided</b> PLEASE REGISTER ONLINE HERE: <a href=\"https://ibm.biz/BdHDt8\"><a href=\"https://ibm.biz/BdHDt8\" class=\"linkified\">https://ibm.biz/BdHDt8</a></a><br/><i>Seating is limited.</i></p> ", "visibility": "public", "comment_count": 0}, {"created": 1462026510000, "duration": 14400000, "id": "230766371", "name": "Apache Spark Maker Community Event", "status": "past", "time": 1465248600000, "updated": 1465263858000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 5, "venue": {"id": 24126294, "name": "Galvanize U", "lat": 37.78749465942383, "lon": -122.39653015136719, "repinned": false, "address_1": "44 Tehama Street", "city": "San Francisco", "country": "us", "localized_country_name": "USA", "zip": "", "state": "CA"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/230766371/", "description": "<p>On June 6, 2016, leading minds in data and analytics from Tesla, Netflix, Silicon Valley Data Science, and IBM will come together to demonstrate how open data and analytics technologies such as R, Spark, Python and more are forming a vibrant ecosystem.  The community has a shared goal of working with all data to build unexpected insights and launch new business applications.</p> <p>The Apache Spark Maker Community Event will bring together data scientists, data engineers, data developers, and data designers June 6th @ 6pm at Galvanize, San Francisco. Here’s the plan:   </p> <p>- The Big Reveal – New sample Apache Spark apps and tools</p> <p>- Use Cases – Monsanto will share how they are using R and Spark to optimize their supply chain</p> <p>- Learning Session - Hear from experts working on Spark projects and building the Spark ecosystem of open data and analytics technologies</p> <p>- Networking Opportunity – Food, drinks and data, explore a Hall of Innovation showcasing Spark demos</p> <p>Join us. Learn more here:  <b><i><a href=\"http://www.ibm.com/analytics/us/en/events/apache-spark/\">Apache Spark Maker Community Event</a></i></b> </p> <p>Registration begins at 5:30 PM and the discussion starts at 6:30 PM; food and drinks will be served. You must register for this event. </p> <p>To get your ticket, and attend in person, click <b><a href=\"https://www.eventbrite.com/e/apache-sparktm-maker-community-event-registration-24742595770?cm_mc_uid=39680333471514613509392&amp;cm_mc_sid_50200000=1461961944\">HERE</a></b>. </p> <p>Can't attend in person? We'll be live streaming this event on a computer screen near you! Register for the  <b><a href=\"https://www.eventbrite.com/e/livestream-apache-sparktm-maker-community-event-registration-24790223225?cm_mc_uid=39680333471514613509392&amp;cm_mc_sid_50200000=1461961944\">live stream</a></b> and we'll send you a calendar update and login link.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1464929659000, "duration": 28800000, "id": "231614605", "name": "Intro to Apache Spark - Hands On", "status": "past", "time": 1466598600000, "updated": 1466629573000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 9, "venue": {"id": 24584511, "name": "DMD Data Systems Office   ", "lat": 38.249107360839844, "lon": -85.5105972290039, "repinned": false, "address_1": "13050 Eastgate Pkwy #108", "city": "Louisville", "country": "us", "localized_country_name": "USA", "zip": "", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/231614605/", "description": "<p><b>Hands on Introduction to Apache Spark for Data Engineers, Data Scientist and Developers</b></p> <p><br/>Please join us for a free DMD Data Systems and IBM sponsored proof of technology for clients and practitioners on Apache Spark. This is a full day of education on Apache Spark with hands on exercises instructed in person by Apache Spark experts. The POT will provide a detailed overview of Apache Spark and Data Science methodology. The Lab will be performed using open source notebooks (Jupyter and/or Zeppelin) on publicly available datasets. Participants will use IBM’s fully managed Apache Spark Cloud platform available for educational purposes.</p> <p><i><b>PLEASE NOTE - SEATS ARE LIMITED. IN ORDER TO CONFIRM YOUR SEAT, YOU MUST REGISTER HERE:   <a href=\"https://www.eventbrite.com/e/ibm-analytics-hands-on-apache-spark-workshop-tickets-25801643410\">Apache Spark - June 22</a></b></i></p> <p><br/><b>Who should go</b>:<br/>Anyone interested in learning more about Apache Spark<b><br/></b></p> <p><b>Prerequisite</b>:<br/>A working knowledge of Coding (Preferred Python and/or Scala), understand distributed computing, Spark and SQL</p> <p><b>What to expect: </b><br/>Expect to spend a full day of lecture and hands on exercises attacking real-world data challenges using Apache Spark. In 8 hours you will learn the basic essentials of Apache Spark and why it's important to your organization. This workshop will focus on data wrangling and machine learning.</p> <p><b>Full Day Agenda:</b><br/>8:30am – 9:00am  Breakfast, Socialize<br/>9:00am – 9:30am  Spark &amp; IBM<br/>9:30am – 10:30am  Apache Spark Overview<br/>10:30am – 11:30am  Lab 1, Hello Spark - Hand on exercise<br/>11:30 am – 12:00pm  Apache Spark SQL Overview<br/>12:00 pm – 1:00pm  Lunch<br/>1:00pm – 2:00pm  Lab 2, Spark SQL - Hands on exercises<br/>2:00pm – 3:00pm  Overview of Data Science &amp; Machine Learning w/ Apache Spark<br/>3:00pm – 4:00pm  Lab 3, Machine Learning w/ Spark – Hands on exercises<br/>4:00pm – 4:30pm  Wrap-up – Feedback from attendees</p> <p>Join DMD Data Systems and IBM for an optional happy hour from 5:00pm – 6:30pm </p> <p><br/><b>Registration:</b></p> <p>Seats are limited, register today to reserve your spot!</p> <p><b><a href=\"https://www.eventbrite.com/e/ibm-analytics-hands-on-apache-spark-workshop-tickets-25801643410\"><a href=\"https://www.eventbrite.com/e/ibm-analytics-hands-on-apache-spark-workshop-tickets-25801643410\" class=\"linkified\">https://www.eventbrite.com/e/ibm-analytics-hands-on-apache-spark-workshop-tickets-25801643410</a></a></b></p> ", "how_to_find_us": "Zip 40223", "visibility": "public", "comment_count": 12}, {"created": 1464825175000, "id": "231579692", "name": "Show Us Your Apps - Apache Spark Maker Build Global Hackathon", "status": "past", "time": 1471986000000, "updated": 1471998692000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 2, "venue": {"id": 24581652, "name": "Global Online Hackathon", "lat": 36.77825927734375, "lon": -119.41793060302734, "repinned": false, "address_1": "Any Street", "city": "Any City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "CA"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/231579692/", "description": "<p><b>THIS IS A GLOBAL ON-LINE HACKATHON THAT BEGINS MAY 23, 2016 AND <i>NOW ENDS AUGUST 23, 2016</i>.  SUBMISSIONS DUE AUGUST 23rd BY 5:00 PM EST. </b></p> <p><b>We’re extending the hackathon deadline to August 23</b> - that’s 20 additional days to build your Spark enterprise app. (View the revised competition calendar <b><a href=\"http://apachespark.devpost.com/details/dates\">HERE</a></b><b>.  </b>We're giving you more time because....</p> <p>We’re adding <b>new enterprise data resources</b> to the site and we want to give you a chance to incorporate these into your projects, if you so choose.  Our awesome data co-sponsors <b><a href=\"http://www.yelp.com/nyc\">Yelp</a></b> and <b><a href=\"https://uncharted.software/\">Uncharted Software</a></b> have generously shared some of their enterprise data sets for you to use during the hackathon.</p> <p>Yelp’s data includes 2.2M reviews by 552K users for 77K businesses. The Uncharted data includes Bitcoin network transactions from processing the Bitcoin blockchain as of mid-2014 <i>and</i> Amazon product reviews from 1995 through 2003. For a fuller description and data access, visit our <b><a href=\"http://apachespark.devpost.com/details/resources#datasets\">resources page</a></b>.</p> <p>Uncharted Software also has a couple cool Spark data visualization libraries you should check out: <b><a href=\"http://unchartedsoftware.github.io/salt/\">Salt</a></b> and <b><a href=\"http://unchartedsoftware.github.io/sparkpipe-core/\">SparkPipe.</a></b></p> <p>And, in case you’d like to weigh the effects of weather on business operations, we’re also offering access to the full suite of <b><a href=\"http://apachespark.devpost.com/details/weather_data\">Weather Company APIs</a></b> for the duration of the hackathon.</p> <p>Finally, if you’re looking for a hosting solution for your Spark app, we’re now offering <b>extended Bluemix trials for all hackathon participants</b>. Using Bluemix services to build your project is <b><i>totally optional</i></b>, but might be a good way to get your app up and running — particularly with the IBM Analytics for Apache Spark service.</p> <p><b><a href=\"http://apachespark.devpost.com/details/bluemix_promo\">You can request your extended Bluemix trial code here.</a> </b> For all hackathon participants, trials will extend through November 1, 2016. <i>Now go forth and optimize for the enterprise!</i></p> <p>---------------------</p> <p>Build an Apache Spark application to address a real business problem or core concern related to customer care, marketing, risk management or operations. Join IBM and Devpost for a global hackathon using <b><a href=\"http://apachespark.devpost.com/?utm_source=facebook-partner&amp;utm_medium=wall-post&amp;utm_campaign=apachespark\">Apache Spark Makers Build</a></b>.  There are $100,000 in cash prizes.  Submissions can be sent in up to August 23rd.</p> <p><i>Participation Details: </i>To participate in the global virtual hackathon, you can <b><a href=\"http://apachespark.devpost.com/?utm_source=facebook-partner&amp;utm_medium=wall-post&amp;utm_campaign=apachespark\">register here</a></b>.  Please review all registration guidelines.</p> <p>For the hack, you will apply Apache Spark's powerful analytics capabilities to enterprise and other relevant data so data scientists and software developers can build an analytics or mobile/web app that tackles a key business problem in marketing, customer case, operations or risk management.  The grand prize is $50,000, and the top three winners each get a meeting with the judge or<br/>Spark community expert of their choice; the judging panel includes data experts from Tesla, Netflix, and Silicon Valley Data Science.</p> <p>Go to <b><a href=\"http://apachespark.devpost.com/?utm_source=facebook-partner&amp;utm_medium=wall-post&amp;utm_campaign=apachespark\">apachespark.devpost.com</a></b> for full details and registration.  Please review all registration rules.</p> <p><b> <i>Questions?</i></b></p> <p>We're here to help. If you have any questions about the hackathon, post on the <b><a href=\"http://apachespark.devpost.com/forum_topics\">discussion forum</a></b> or email <b><i>support@devpost.com</i></b> and we'll respond as soon as we can.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1472502140000, "duration": 14400000, "id": "233719510", "name": "DataFirst Launch Event – Experience new ways to put your data to work", "status": "past", "time": 1475013600000, "updated": 1475029772000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 3, "venue": {"id": 24745891, "name": "Hudson Mercantile Bldg", "lat": 40.755863189697266, "lon": -73.99864959716797, "repinned": false, "address_1": "500 West 36th Street", "city": "New York", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/233719510/", "description": "<p>On September 27, 2016, leading minds in data and analytics will come together and unveil the latest in cloud technology, enabling you to more efficiently put data to work. Experience how Spark, Hadoop, Python, and more are being used to bring together all types of data professionals –from data engineers, to data scientists, developers and business analysts –to work in new collaborative ways.</p> <p>The IBM DataFirst Launch Event will unite data and analytics leaders and practitioners from the open source community, startups, and enterprises. Check the <i><b><a href=\"http://www.ibm.com/analytics/us/en/events/datafirst/index.html\">event site</a></b></i> for the latest lineup of guest speakers. The event takes place @ 6pm at the Hudson Mercantile Building, NYC.</p> <p>Here’s the plan:<br/>• The Big Reveal –Experience new ways to work for data engineers, data scientist, developers, and business analysts, both individually and collectively.</p> <p>•Hands-on sessions – With interactive experiences for each of these professions.</p> <p>•Use Cases –Community leaders and guest speakers will share their expertise and vision<br/>•Networking Opportunity – Food, drinks, data, collaborative demos, and a party on the rooftop</p> <p>Learn more here:<a href=\"http://www.ibm.com/analytics/us/en/events/datafirst/index.html#\">  <i><b>DataFirst Launch Event</b></i></a></p> <p>Check-in and networking begins at 6:00 PM.  Food and drinks will be served. You must register for this event.</p> <p>To get your ticket, and attend in person, click <b><a href=\"https://www.eventbrite.com/e/ibm-datafirst-launch-event-registration-26725283041\">HERE</a></b>.  </p> <p>Can't attend in person? We'll be live streaming this event.  Register for the <b><a href=\"https://www.eventbrite.com/e/livestream-ibm-datafirst-launch-event-registration-26906650516\">LIVE STREAM </a></b>and we'll send you a calendar update and login link. </p> ", "how_to_find_us": "zip 10018", "visibility": "public", "comment_count": 0}, {"created": 1481833790000, "duration": 3600000, "id": "236264885", "name": "Making Data Simple in the Cognitive Era", "status": "past", "time": 1482253200000, "updated": 1482258639000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 8, "venue": {"id": 24947708, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2gOcufe", "city": "Louisville", "country": "us", "localized_country_name": "USA", "zip": "", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/236264885/", "description": "<p>RSVP: <a href=\"http://bit.ly/2gOcufe\"><a href=\"http://bit.ly/2gOcufe\" class=\"linkified\">http://bit.ly/2gOcufe</a></a></p> <p>This webinar will cover an overview of Watson Data Platform capabilities and how to empower users across the organization to make the most out of their data. What if you can shorten the time it takes to create value out of your existing organizational data ? </p> <p>What if you can provision a common analytic engine with managed services that will enable you to embrace multiple cloud platforms ? IBM Watson Data Platform is the first cloud-based data and analytics platform to support cognitive businesses. It enables access, collaboration and paths to insights by connecting all users through trusted access to a variety of data, discovering new possibilities and opportunities with built-in intelligence, automation and machine learning and accelerating outcomes with rapid deployment of new data models and fast embedding of insights into processes, applications and services. </p> <p>Let us show you how Watson Data Platform can be the milestone of your organization analytics strategy and empower your organization into the new Cognitive analytics era.</p> <p><b>Speaker Bio: </b><br/>Gerardo Rodríguez Díaz – is an avid traveler, technologist enthusiast and Big data and Analytics cloud solution specialist focused on communications and computer systems integrations industries across North America. GRD areas of specialization are IT, Marketing and Business Intelligence having worked across European, North and South American markets.</p> ", "how_to_find_us": "Time is Eastern Standard Time", "visibility": "public", "comment_count": 0}, {"created": 1485434423000, "duration": 12600000, "id": "237214408", "name": "Machine Learning Launch", "status": "past", "time": 1487185200000, "updated": 1487198956000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 19, "venue": {"id": 25013304, "name": "LIVESTREAM", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://ibm.co/MLevent", "city": "Louisville", "country": "us", "localized_country_name": "USA", "zip": "", "state": "KY"}, "group": {"created": 1408631611000, "name": "Louisville Business Intelligence & Big Data Analytics Meetup", "id": 16526912, "join_mode": "open", "lat": 38.2599983215332, "lon": -85.75, "urlname": "Louisville-BI-Big-Data-Analytics-Meetup", "who": "Members"}, "link": "https://www.meetup.com/Louisville-BI-Big-Data-Analytics-Meetup/events/237214408/", "description": "<p>The demand for machine learning is booming! </p> <p>Calling all IT executives, data scientists, Chief Data Officers, data architects and other data geeks.  Join us on <b>February 15th from 2:00-5:30 pm ET </b>via livestream  (replay available starting February 16th) , and discover how machine learning is fundamentally changing the way we work and live.  Hear about cognitive applications that anticipate behavior and learn from data without being explicitly programmed.</p> <p>You'll learn about the latest breakthrough developments on machine learning as well as Spark, data and analytics. Mike Gualtieri, Vice President and Principal Analyst, Forrester, will present his view on how to best leverage technologies such as big data, predictive analytics, Hadoop/Spark, machine learning, data science, and AI.  Rob Thomas, General Manager, IBM Analytics will host an agenda which will include guest speakers and cover the following topics:</p> <p>•  Machine Learning Overview</p> <p>•  Top Trends in Machine Learning &amp; Cognitive Applications</p> <p>•  Cognitive Analytics and Machine Learning for the Enterprise</p> <p>•  Live Product Demonstration &amp; Client Roundtable on Machine Learning</p> <p>•  Data Innovation with Hybrid Transaction/Analytical Processing</p> <p>•  Spark &amp; Machine Learning for Enterprise Systems</p> <p>For additional details and to REGISTER, please visit <i><b><a href=\"http://www.ibm.com/analytics/us/en/events/machine-learning/\">MACHINE LEARNING.</a></b></i></p> <p>Register NOW and we'll send you a reminder!</p> ", "how_to_find_us": "Livestream is Eastern Standard Time (EST) - Adjust to your time zone", "visibility": "public", "comment_count": 3}]