[{"created": 1446861384000, "id": "226603326", "name": "Continuous Data Management for Hadoop and Spark – On-Premise or in the Cloud", "status": "past", "time": 1449700200000, "updated": 1449844892000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 49, "venue": {"id": 24219644, "name": "HopsScotch", "lat": 40.71782302856445, "lon": -74.03630828857422, "repinned": false, "address_1": "286 Washington St", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/226603326/", "manual_attendance_count": 49, "description": "<p>Hi, everyone.  Please join us and our awesome presenters on Dec 9th at 5:30 pm .  See you there!  </p> <p><br/><b>AGENDA</b></p> <p>• Continuous Data Management for Hadoop and Spark – On-Premise or in the Cloud.   Brett Rudenstein, Director of Product Management, Big Data, Wandisco</p> <p>• Deploying Big Data in the Insurance Industry.  David Skrivanek – Big Data expert from a leading insurance company</p> <p>• Big SQL - Making all of your <a href=\"http://www.ibm.com/software/data/bigdata/\">big data</a> SQL accessible using an optimal execution strategy. Presenters:  Michael Harkins, Virender Thakur, IBM</p> <p>\n\n\n<b>Continuous Data Management for Hadoop and Spark – On-Premise or in the Cloud</b></p> <p>KEYNOTE SPEAKER: </p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/9/a/d/600_444879341.jpeg\" /></p> <p>\n\n\nBrett Rudenstein, Director of Product Management, Big Data, Wandisco</p> <p>Brett Rudenstein has an extensive background in Application Lifecycle Management, High Performance Computing and Open Source Software Analysis. He has held senior sales engineering and management positions at Rational Software, PureAtria, IBM, Appistry and Palamida. Throughout his career, he has enabled organizations to accelerate technology adoption by understanding their needs and providing just-in-time business solutions. As WANdisco Director of Product Management for Big Data, Brett works with partners, prospects, and customers to help them understand and evolve the requirements for enterprise-ready Hadoop.</p> <p><br/>----------------</p> <p>Big Data makes it possible to inexpensively store and process petabytes of structured, unstructured and semi-structured data generated at incredible speeds. However, the ultimate benefits of big data are lost if fresh, fast-moving data is not analyzed as it happens. Fast data is about data in motion—immediate response and action. </p> <p>The collection process for data in motion is essentially the same as data at rest, but the key difference is the analysis occurs in real time as data is generated and captured. However, this analysis has to include the historical context provided by data at rest in order to be meaningful. This requires an enterprise-ready architecture that efficiently handles both data at rest and data in motion with the following components: </p> <p>- An enterprise grade Big Data platform to support real-time analytics applications without downtime or data loss <br/>- A flexible and agile cloud environment for cost-effective burst-out processing <br/>- A data migration/replication engine that exceeds the most demanding application SLAs. </p> <p>This meet up will provide an overview of the “best in class” architecture required to harness the benefits of Big Data with “Continuous Data Management for Hadoop and Spark” </p> <p><br/><b>Big SQL 4.1.</b> Presenters: </p> <p> Michael Harkins, Virender Thakur, IBM</p> <p> Big SQL provides ANSI SQL access to data across any system from Hadoop, via JDBC or ODBC - seamlessly whether that data exists in Hadoop or a relational data base. This means that developers familiar with the SQL programming language can access data in Hadoop without having to learn new languages or skills. Big SQL sets a new bar: performance. Benchmark tests indicate that Big SQL executes queries 20 times faster, on average, over Apache Hive 12 with performance improvements ranging up to 70 times faster. It can query and combine data from many data sources, including (but not limited to) DB2 for Linux, Teradata, Oracle, UNIX and Windows database software, IBM PureData System for Analytics. </p> <p>With Big SQL, all of your big data is SQL accessible. It presents a structured view of your existing data, using an optimal execution strategy, given your available resources. </p> <p><b>PARKING</b></p> <p>Street parking in certain areas (across the street &amp; up to 2 blocks away) at 5pm is free.  Check the signs so as not to get booted! </p> <p>Garage parking is on Columbus Drive in the same building as HopsScotch.  They validate parking for $2.00 up to 4 hours. </p> ", "visibility": "public", "comment_count": 9}, {"created": 1462218784000, "id": "230821853", "name": "Apache Spark Maker Community Event", "status": "past", "time": 1465263000000, "updated": 1465275359000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 4, "venue": {"id": 24523428, "name": "Galvanize U", "lat": 37.787601470947266, "lon": -122.39664459228516, "repinned": false, "address_1": "44 Tehama Street", "city": "San Francisco", "country": "us", "localized_country_name": "USA", "zip": "", "state": "CA"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/230821853/", "description": "<p>On June 6, 2016, leading minds in data and analytics from Tesla, Netflix, Silicon Valley Data Science, and IBM will come together to demonstrate how open data and analytics technologies such as R, Spark, Python and more are forming a vibrant ecosystem. The community has a shared goal of working with all data to build unexpected insights and launch new business applications. </p> <p> <br/>The Apache Spark Maker Community Event will bring together data scientists, data engineers, data developers, and data designers June 6th @ 6pm at Galvanize, San Francisco. Here’s the plan: </p> <p> <br/>- The Big Reveal – New sample Apache Spark apps and tools <br/>- Use Cases – Monsanto will share how they are using R and Spark to optimize their supply chain <br/>- Learning Session - Hear from experts working on Spark projects and building the Spark ecosystem of open data and analytics technologies <br/>- Networking Opportunity – Food, drinks and data, explore a Hall of Innovation showcasing Spark demos </p> <p>Join us. Learn more here: <a href=\"http://www.ibm.com/analytics/us/en/events/apache-spark/\">Apache Spark Maker Community Event </a>. </p> <p>Registration begins at 5:30 PM and the discussion starts at 6:30 PM; food and drinks will be served. You must register for this event. </p> <p>To get your ticket, and attend in person, click <a href=\"https://www.eventbrite.com/e/apache-sparktm-maker-community-event-registration-24742595770?cm_mc_uid=39680333471514613509392&amp;cm_mc_sid_50200000=1461961944\">HERE</a>. </p> <p>Can't attend in person? We'll be live streaming this event on a computer screen near you! Register for the <a href=\"https://www.eventbrite.com/e/apache-sparktm-maker-community-event-registration-24742595770?cm_mc_uid=39680333471514613509392&amp;cm_mc_sid_50200000=1461961944\">live stream</a> and we'll send you a calendar update and login link.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1479938985000, "duration": 21600000, "id": "235787933", "name": "Introducing Spark/Hadoop/Cloud Data Warehouse Hands-on Lab", "status": "past", "time": 1480426200000, "updated": 1480454691000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 5, "venue": {"id": 24916292, "name": "IBM", "lat": 40.74349594116211, "lon": -73.98553466796875, "repinned": false, "address_1": "63 Madison Ave", "city": "New York", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NY"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/235787933/", "description": "<p>IBM is offering a free hands-on lab for Data Scientists, Data Engineers and Developers. Come join IBM for an Apache Spark, Hadoop and Cloud Data Warehouse learning session. <b>You must pre-register: <a href=\"https://www.eventbrite.com/e/apache-spark-cloud-data-warehouse-hadoop-ibm-cloud-on-demand-analytics-tickets-29125975577\">Registration</a></b></p> <p><b>Overview</b> </p> <p>During the session participants will learn how to gain insight and optimize their actions utilizing all of their data - structured and unstructured data - across multiple cloud data sources. In this session we will look at the three most common types of analytic and data storage tools customers are using today: </p> <p>1- Spark for running analytics across all available data, on-premises and on the cloud<br/> 2- Hadoop on the cloud for capturing and storing unstructured and semi-structured data, plus offloading cold data from data warehouses<br/> 3- Data Warehouses that have a long history of tradition with structured data, now available in cloud </p> <p><b>Prerequisite</b><br/><b>BRING YOUR OWN LAPTOP! </b>Please sign up for a Bluemix account at bluemix.net. </p> <p>This session is offered free of charge. Continental breakfast and lunch will be provided. Participants are responsible for their own business travel expenses. <b>You must pre-register: <a href=\"https://www.eventbrite.com/e/apache-spark-cloud-data-warehouse-hadoop-ibm-cloud-on-demand-analytics-tickets-29125975577\">Registration</a></b></p> ", "visibility": "public", "comment_count": 0}, {"created": 1479911952000, "duration": 3600000, "id": "235779013", "name": "Managed Platform for Multiple Open Source Databases Webinar", "status": "past", "time": 1480438800000, "updated": 1480444132000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 6, "venue": {"id": 24915598, "name": "Live Online Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2f573mJ", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/235779013/", "description": "<p><a href=\"http://bit.ly/2f573mJ\">Register for the Live Online Webinar</a> </p> <p>Organizations are striving to become more agile and move to the cloud, as they develop cutting-edge enterprise applications for today’s market. As enterprise development teams increasingly choose open source databases to leverage proven cloud-scale solutions, they also find that no single database can meet their needs and are therefore adopting a multi- database strategy. This situation presents enterprises with challenges as they struggle to support new data technologies in production while reducing costs and managing risk. </p> <p>IBM® Compose Enterprise delivers an IBM-managed cloud data platform through IBM Bluemix® Dedicated, SoftLayer or Amazon Web Services, enabling your organization to run a wide variety of open source, databases: mongoDB, Redis, elasticsearch, PostgreSQL, RethinkDB, RabbitMQ, and etcd. During this webinar, we will look closely at Compose, and explore the different databases and managed services. </p> <p><b>Speaker Bio:  </b><br/>Saswata Sengupta is an Open Source Technical Evangelist for IBM Big data and Analytics group, with expertise in data science/engineering, Spark, Big Insights, Hadoop, IBM Data Science and Watson Cognitive solutions. He has over 16+ years of experience in the technology industry and more than 4 years working with Big Data Technologies like Hadoop, Hive, Spark, Storm, Kafka and Elastic Search. Saswata holds a Masters from University of Wales and enjoys reading, hiking and crossfit.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1479917365000, "duration": 3600000, "id": "235780565", "name": "Building a Recommendation Engine for Movies with Spark ML - Webinar", "status": "past", "time": 1481043600000, "updated": 1481113700000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 27, "venue": {"id": 24915729, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2faW1PV", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/235780565/", "description": "<p><a href=\"http://bit.ly/2faW1PV\"><b>Register for Live Online Webinar</b></a></p> <p>Machine learning, which is commonly defined as the method of allowing computers to learn without being explicitly programmed, is enabling systems to learn, reason and engage with us in a more natural and personalized way. These systems get smarter and more customized through interactions with data, devices and people. Apache Spark’s machine learning (ML) library, makes practical machine learning scalable and easy. In this session, we will introduce machine learning concepts, overview Spark’s ML capabilities, discuss approaches to building systems to make product recommendations to consumers, and walk step by step through a demo showing how to build a movie recommendation system using Spark ML.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1479927462000, "duration": 3600000, "id": "235784099", "name": "Big Data replication - Active-Active replication at two data centers", "status": "past", "time": 1481648400000, "updated": 1481654037000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 15, "venue": {"id": 24916033, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2gg27MH", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/235784099/", "description": "<p><b><a href=\"http://bit.ly/2gg27MH\">Register to Live Webinar</a></b></p> <p>Big Replicate is the world’s only wide area network active transactional replication technology that delivers continuous availability, streaming backup, uninterrupted migration, hybrid cloud and burst-to-cloud, exceeding the most demanding enterprise SLAs across any combination of Hadoop distributions and cloud storage.</p> <p>In this webinar, the speaker will showcase Active-Active replication at two data centers using “Big Replicate” technology. Along with the demo, the speaker will discuss replication use cases in Hadoop.</p> <p><b>Speaker Bio: </b></p> <p>Gautam Siwach is a Technical Evangelist at IBM in their Open Source Analytics team. Gautam has many years of experience in Big Data Solution Architecture and Data Analysis with organizations Accenture, Aetna and JPMC. He is the author of papers in the field of Big Data and Computer Security Algorithms.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1481827595000, "duration": 3600000, "id": "236262494", "name": "Making Data Simple in the Cognitive Era", "status": "past", "time": 1482253200000, "updated": 1482258638000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 12, "venue": {"id": 24947572, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2gOcufe", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/236262494/", "description": "<p>RSVP: <a href=\"http://bit.ly/2gOcufe\" class=\"linkified\">http://bit.ly/2gOcufe</a></p> <p>This webinar will cover an overview of Watson Data Platform capabilities and how to empower users across the organization to make the most out of their data.</p> <p>What if you can shorten the time it takes to create value out of your existing organizational data ? What if you can provision a common analytic engine with managed services that will enable you to embrace multiple cloud platforms ? IBM Watson Data Platform is the first cloud-based data and analytics platform to support cognitive businesses. It enables access, collaboration and paths to insights by connecting all users through trusted access to a variety of data, discovering new possibilities and opportunities with built-in intelligence, automation and machine learning and accelerating outcomes with rapid deployment of new data models and fast embedding of insights into processes, applications and services.</p> <p> Let us show you how Watson Data Platform can be the milestone of your organization analytics strategy and empower your organization into the new Cognitive analytics era.</p> <p><b>Speaker Bio:</b><br/>Gerardo Rodríguez Díaz – is an avid traveler, technologist enthusiast and Big data and Analytics cloud solution specialist focused on communications and computer systems integrations industries across North America. GRD areas of specialization are IT, Marketing and Business Intelligence having worked across European, North and South American markets.</p> ", "visibility": "public", "comment_count": 1}, {"created": 1484168285000, "duration": 3600000, "id": "236854807", "name": "Streaming Data Analytics with Apache Spark Streaming", "status": "past", "time": 1485460800000, "updated": 1485466481000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 30, "venue": {"id": 24985354, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2iHw6yy", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/236854807/", "description": "<p>Streaming analytics and Internet Of Things ( IOT) are gaining momentum in the data and analytics industry. Apache Spark established itself as a leader in fast data processing with its ease of use. With its single execution engine and unified programming model for batch and streaming workloads, it stands out from other distributed stream processing engines. </p> <p>Join this webinar to go over basics and internals of the Streaming module of Apache Spark along with code samples. This topic is intended for audiences with some familiarity or working experience with Apache Spark core.​ </p> <p><br/>Apache Spark Streaming:​ </p> <p><br/>Architecture and Execution Model </p> <p>Spark Streaming I/O </p> <p>Programing model and Streaming Operations (api) </p> <p>Fault tolerance and reliability </p> <p>Performance Considerations </p> <p><br/>Presenter Bio: </p> <p><br/>Suresh Matlapudi is an Open Source Analytics Solution Engineer with IBM. He is a hands-on Engineer with deep experience in distributed data processing, Big Data, Data Warehousing and Hybrid Information Architectures. His current work involves supporting sales teams with pre-sales and technical specifications for Open Source Analytics tools, specifically Hadoop/Spark and execution of several outreach programs to support Open Source adoption by Analytics teams. </p> <p>Before joining IBM he was involved in building some of the large-scale data processing systems at companies like eHarmony, Deem, American Express, Knights Bridge Solutions.</p> ", "visibility": "public", "comment_count": 4}, {"created": 1485369929000, "duration": 3600000, "id": "237195239", "name": "Super Bowl is almost here, so let's have some fun with NFL data", "status": "past", "time": 1485964800000, "updated": 1485969591000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 19, "venue": {"id": 25011882, "name": "Live Webinar ", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2k0GBke ", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/237195239/", "description": "<p>Register at: <a href=\"http://bit.ly/2k0GBke\" class=\"linkified\">http://bit.ly/2k0GBke</a><br/>Working with Spark we will show data engineering operations that will shape and prepare data for analysis. This will include augmenting the existing data set with Weather Data for each of the games. After walking through the engineering and persistence of the data, we will show how to visualize and analyze the data to determine if correlations exist between players and the weather they play in. In this webinar you will get an introduction to the power of Spark, leveraging Python, SQL and simple statistics. You will also be introduced to options around persistence, data sources and visualization.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1485387249000, "duration": 3600000, "id": "237202100", "name": "Big SQL, Powerful Query engine on Hadoop", "status": "past", "time": 1487091600000, "updated": 1487097191000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 26, "venue": {"id": 25012474, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2ktZ7yd", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/237202100/", "description": "<p>Big SQL is a value added service on Big Insights - Big SQL enables users to query Hive and HBase data using ANSI compliant SQL. While Hadoop is highly scalable, Big SQL’s advanced cost-based optimizer and Massively Parallel Processing (MPP) architecture, can run queries smarter, not harder, supporting more concurrent users and more complex SQL with less hardware compared to other SQL solutions for Hadoop.</p> <p>Speaker Bio : Gautam Siwach is a Technical Evangelist at IBM, US in their Open Source Analytic division. Gautam has many years of experience as Chair for Big Data technology conference, Big Data - Subject Matter Expert, and Solution Architect for Data Analysis with organizations like Ryerson, Accenture, Aetna and JPMC. He is the author of papers and journals in the field of Big Data and Computer Security Algorithms for IEEE (US/Canada), ASEE (America), TCN (UK), and holds first class MS degree in Computer Science, Studied at PENNSTATE, YALE, MIT, and UNH. Gautam Siwach is a recognized portfolio advocate by IBM, Software specialist by Microsoft, Licensed Programmer from SUN,Oracle.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1485373101000, "duration": 3600000, "id": "237196748", "name": "Introduction to Spark Structured Streaming", "status": "past", "time": 1487178000000, "updated": 1487185491000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 29, "venue": {"id": 25012022, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2jfIfdA", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/237196748/", "description": "<p>Structured Streaming is a new scalable and fault-tolerant stream processing engine built on the Spark SQL engine. Structured Streaming allows you to express your streaming computation the same way you would express a computation on static data. This has two benefits. The first is code reuse as essentially the same queries be run on batch, interactive or streaming data. Second, it simplifies streaming application development as you can operate on streams of data just like you can on static data using DataFrames. Structured Streaming abstracts away the complexity of streaming analytics allowing you to perform streaming analytics without having to reason about streaming. The Spark SQL engine takes care of running Structured Streaming queries and incrementally and continuously updating the result as streaming data continues to arrive. With Spark Structured Streaming, you can express streaming aggregations, event-time windows, as well as join streaming data to static data. In this session, we’ll walk through the basics of Structured Streaming, its programming model and APIs. The concepts will be illustrated using code examples. Then, we’ll walk through a demo of analyzing both static and streaming sensor data to show how the same queries can be used on each, thereby simplifying streaming analytics application development, and how static and streaming data can be leveraged together.</p> ", "visibility": "public", "comment_count": 3}, {"created": 1488567256000, "duration": 3600000, "id": "238147517", "name": "Generalized Streaming Pipelines with Spark Streaming, Kafka", "status": "past", "time": 1488906000000, "updated": 1488911419000, "utc_offset": -18000000, "waitlist_count": 0, "yes_rsvp_count": 15, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/238147517/", "description": "<p>This is a live webinar. Please register at:</p> <p><a href=\"http://bit.ly/2lnJJYe\" class=\"linkified\">http://bit.ly/2lnJJYe</a>. Join IBM for a deep dive into how to build a cross-industry, scalable streaming pipeline with machine learning using Apache Spark and Apache Kafka! We will connect to a dynamic, real time data source from Wikipedia, ingest it into Kafka and pipe it through to Spark Streaming. There we showcase the power and simplicity of the Spark API with Spark Core, SparkSQL, DataFrames, and SparkMLlib. Finally, we'll write the results of our predictions out to PostgreSQL. Intended audience: Data scientists, data engineers, big data developers.</p> ", "visibility": "public", "comment_count": 4}, {"created": 1490108987000, "duration": 3600000, "id": "238588837", "name": "Using Insights for Twitter service and PySpark to predict daily movie collection", "status": "past", "time": 1490295600000, "updated": 1490300652000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 12, "venue": {"id": 25122227, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2nwIDI7", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/238588837/", "description": "<p>Level: Introductory</p> <p>Description: <br/>IBM Bluemix provides multitude of services in the cloud. One such service is the 'Insights from Twitter', which provides sentiment and other enrichments for tweets.</p> <p>The IBM Data Science Experience is an interactive, collaborative, cloud-based environment where data scientists can use various tools to retrieve insights. </p> <p>In this session, using keywords and tags for a movie we will retrieve the daily sentiments through the 'Insights from Twitter' service, combine it with actual daily movie collections to create a simple model. This model can then be used for predicting collections for related movies and sequels.</p> <p>Please attend and see how all this can be achieved easily by leveraging SparkSQL and Python along with machine learning.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1493232034000, "duration": 2700000, "id": "239516359", "name": "Discussing the best Open Source Tools for Analytics", "status": "past", "time": 1493308800000, "updated": 1493314207000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 3, "venue": {"id": 25202072, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2pdsXha", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/239516359/", "description": "<p>Live Webinar: <a href=\"http://bit.ly/2pdsXha\"><a href=\"http://bit.ly/2pdsXha\" class=\"linkified\">http://bit.ly/2pdsXha</a></a></p> <p>Faced with the challenge of using big data to innovate in their fields and grow their businesses, companies are moving toward open-source-based data analytics tools. During this talk we will discuss various tools and technologies in the Open Source Analytics domain and various possible use cases.</p> <p>The discussion would cover Open Source Components around </p> <p>§Analytics</p> <p>§Building a Data Lake/Swamp/Reservoir </p> <p>§SQL Query Engine on Data lake </p> <p>§IOT Platform/Real Time Applications </p> <p>§Visualization on data using Data Science Experience</p> <p>§Artificial Intelligence and Machine Learning components  </p> <p>§Databases deployment service (Elastic Search, Mongodb, etcd, etc</p> ", "visibility": "public", "comment_count": 0}, {"created": 1493233141000, "duration": 3600000, "id": "239516813", "name": "Market Segmentation Analysis on the Watson Data Platform", "status": "past", "time": 1493913600000, "updated": 1493919870000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 17, "venue": {"id": 25202131, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2pX9eOX", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/239516813/", "description": "<p>Marketers and Analysts are looking for ways to increase revenue by segmenting their customers. Leveraging Data Science, Cognitive capabilities and Guided Data Discovery, they will be able to identify lead segments of purchasers and better target their marketing as well as strategic sales efforts.</p> <p>In this webinar we will use Cloud Services such as IBM Data Science Experience, Watson Analytics, and Watson APIs to demonstrate how to effectively perform a market segmentation analysis.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1493734290000, "duration": 3600000, "id": "239664455", "name": "Enterprise Active Data Replication Done Right with IBM Big Replicate", "status": "past", "time": 1494000000000, "updated": 1494005616000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 4, "venue": {"id": 25214448, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2oAxcn4", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/239664455/", "description": "<p>Registration: <a href=\"http://bit.ly/2oAxcn4\" class=\"linkified\">http://bit.ly/2oAxcn4</a></p> <p>As enterprise adoption of Hadoop increases, the challenges associated with moving Hadoop from experiments or lab to actual mission critical production environment have also been prevalent. Challenges such as data availability and consistency across the Hadoop clusters, commercial data warehouse/sources and locations as well as regulatory data protection concerns create major hindrance to mission critical use. This session will cover how IBM BigReplicate helps you overcome these challenges and ensure you unleash the most value out of your Hadoop deployments whether on cloud and/or on-premise. Speaker:<br/>Kevin Wang is a senior Big Data support engineer and evangelist who is passionate about partnering with companies big and small to unlock the most value out of their IBM Big Data solutions such as IBM BigInsights, IBM Open Platform and IBM BigReplicate.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1493238471000, "duration": 3600000, "id": "239519301", "name": "Analyzing Reddit users’ comments with SparkML and Watson", "status": "past", "time": 1495566000000, "updated": 1495571104000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 20, "venue": {"id": 25202372, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2q79dsE", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/239519301/", "description": "<p>Unsupervised machine learning helps to show you patterns in your data without any predefined labels. Using Reddit comments, we can apply a term frequency - inverse document frequency statistic to each comment among a group, and cluster them by keywords using SparkML. With these clusters, we can then discover personality insights using one of IBM Watson API’s.</p> <p>Join us to learn how to leverage the power of Apache Spark through SparkML, and one of Watson Cognitive APIs: Personality Insights.</p> ", "visibility": "public", "comment_count": 0}, {"created": 1493233445000, "duration": 3600000, "id": "239516907", "name": "Exploring DSX, a Platform for Data Scientists using Open Source Technologies", "status": "past", "time": 1495641600000, "updated": 1495648537000, "utc_offset": -14400000, "waitlist_count": 0, "yes_rsvp_count": 11, "venue": {"id": 25202148, "name": "Live Webinar", "lat": 0.0, "lon": 0.0, "repinned": false, "address_1": "http://bit.ly/2pwL55a", "city": "Jersey City", "country": "us", "localized_country_name": "USA", "zip": "", "state": "NJ"}, "group": {"created": 1446859015000, "name": "Open Source Analytics - New Jersey", "id": 19097690, "join_mode": "open", "lat": 40.72999954223633, "lon": -74.05000305175781, "urlname": "Open-Source-Analytics-New-Jersey", "who": "Members"}, "link": "https://www.meetup.com/Open-Source-Analytics-New-Jersey/events/239516907/", "description": "<p>During this talk we will be demonstrating Data Science Experience (DSX), a Gartner's recommended collaborative platform with Data Science and Machine learning capabilities. If you are a data scientist using Open Source technologies such as python, R, Apache Spark and Tensorflow, join us to explore building models and the platform's unique capability to automatically identify and build models that can then be deployed in several contexts.</p> ", "visibility": "public", "comment_count": 0}]